nxp-mcuxpresso/mcux-soc-svd/MCXC141/MCXC141.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX0</name>
      <description>DMA channel multiplexor</description>
      <prependToName>DMAMUX0_</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CHCFG%s</name>
          <description>Channel Configuration register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b000000</name>
                  <description>Disable_Signal</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b000010</name>
                  <description>LPUART0_Rx_Signal</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b000011</name>
                  <description>LPUART0_Tx_Signal</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b000100</name>
                  <description>LPUART1_Rx_Signal</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b000101</name>
                  <description>LPUART1_Tx_Signal</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b000110</name>
                  <description>UART2_Rx_Signal</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b000111</name>
                  <description>UART2_Tx_Signal</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b001010</name>
                  <description>FlexIO_Channel0_Signal</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b001011</name>
                  <description>FlexIO_Channel1_Signal</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b001100</name>
                  <description>FlexIO_Channel2_Signal</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b001101</name>
                  <description>FlexIO_Channel3_Signal</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010000</name>
                  <description>SPI0_Rx_Signal</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010001</name>
                  <description>SPI0_Tx_Signal</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010010</name>
                  <description>SPI1_Rx_Signal</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010011</name>
                  <description>SPI1_Tx_Signal</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010110</name>
                  <description>I2C0_Signal</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010111</name>
                  <description>I2C1_Signal</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011000</name>
                  <description>TPM0_Channel0_Signal</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011001</name>
                  <description>TPM0_Channel1_Signal</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011010</name>
                  <description>TPM0_Channel2_Signal</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011011</name>
                  <description>TPM0_Channel3_Signal</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011100</name>
                  <description>TPM0_Channel4_Signal</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011101</name>
                  <description>TPM0_Channel5_Signal</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100000</name>
                  <description>TPM1_Channel0_Signal</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100001</name>
                  <description>TPM1_Channel1_Signal</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100010</name>
                  <description>TPM2_Channel0_Signal</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100011</name>
                  <description>TPM2_Channel1_Signal</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b101000</name>
                  <description>ADC0_Signal</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b101010</name>
                  <description>CMP0_Signal</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110001</name>
                  <description>PortA_Signal</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110010</name>
                  <description>PortB_Signal</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110011</name>
                  <description>PortC_Signal</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110100</name>
                  <description>PortD_Signal</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110101</name>
                  <description>PortE_Signal</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110110</name>
                  <description>TPM0_Overflow_Signal</description>
                  <value>#110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110111</name>
                  <description>TPM1_Overflow_Signal</description>
                  <value>#110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111000</name>
                  <description>TPM2_Overflow_Signal</description>
                  <value>#111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111100</name>
                  <description>AlwaysOn60_Signal</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111101</name>
                  <description>AlwaysOn61_Signal</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111110</name>
                  <description>AlwaysOn62_Signal</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111111</name>
                  <description>AlwaysOn63_Signal</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>DMA Channel Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>DMA channel is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
