nxp-mcuxpresso/mcux-soc-svd/MCXC141/MCXC141.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SHIFTCFG%s</name>
          <description>Shifter Configuration N Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSTART</name>
              <description>Shifter Start bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on enable</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on first shift</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Transmitter outputs start bit value 0 before loading data on first shift, receiver/match store sets error flag if start bit is not 0</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Transmitter outputs start bit value 1 before loading data on first shift, receiver/match store sets error flag if start bit is not 1</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSTOP</name>
              <description>Shifter Stop bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Stop bit disabled for transmitter/receiver/match store</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Reserved for transmitter/receiver/match store</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Transmitter outputs stop bit value 0 on store, receiver/match store sets error flag if stop bit is not 0</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Transmitter outputs stop bit value 1 on store, receiver/match store sets error flag if stop bit is not 1</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSRC</name>
              <description>Input Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Pin</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Shifter N+1 Output</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SHIFTBUF%s</name>
          <description>Shifter Buffer N Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUF</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SHIFTBUFBIS%s</name>
          <description>Shifter Buffer N Bit Swapped Register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SHIFTBUFBYS%s</name>
          <description>Shifter Buffer N Byte Swapped Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBYS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SHIFTBUFBBS%s</name>
          <description>Shifter Buffer N Bit Byte Swapped Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>TIMCTL%s</name>
          <description>Timer Control N Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMOD</name>
              <description>Timer Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Timer Disabled.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Dual 8-bit counters baud/bit mode.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Dual 8-bit counters PWM mode.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Single 16-bit counter mode.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOL</name>
              <description>Timer Pin Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Pin is active high</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Pin is active low</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Timer Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINCFG</name>
              <description>Timer Pin Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Timer pin output disabled</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Timer pin open drain or bidirectional output enable</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Timer pin bidirectional output data</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Timer pin output</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>External trigger selected</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Internal trigger selected</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPOL</name>
              <description>Trigger Polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Trigger active high</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Trigger active low</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>TIMCFG%s</name>
          <description>Timer Configuration N Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTART</name>
              <description>Timer Start Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Start bit disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Start bit enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Timer Stop Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Stop bit disabled</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Stop bit is enabled on timer compare</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Stop bit is enabled on timer disable</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Stop bit is enabled on timer compare and timer disable</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMENA</name>
              <description>Timer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b000</name>
                  <description>Timer always enabled</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b001</name>
                  <description>Timer enabled on Timer N-1 enable</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010</name>
                  <description>Timer enabled on Trigger high</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011</name>
                  <description>Timer enabled on Trigger high and Pin high</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100</name>
                  <description>Timer enabled on Pin rising edge</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b101</name>
                  <description>Timer enabled on Pin rising edge and Trigger high</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110</name>
                  <description>Timer enabled on Trigger rising edge</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111</name>
                  <description>Timer enabled on Trigger rising or falling edge</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDIS</name>
              <description>Timer Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b000</name>
                  <description>Timer never disabled</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b001</name>
                  <description>Timer disabled on Timer N-1 disable</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010</name>
                  <description>Timer disabled on Timer compare</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011</name>
                  <description>Timer disabled on Timer compare and Trigger Low</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100</name>
                  <description>Timer disabled on Pin rising or falling edge</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b101</name>
                  <description>Timer disabled on Pin rising or falling edge provided Trigger is high</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110</name>
                  <description>Timer disabled on Trigger falling edge</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMRST</name>
              <description>Timer Reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b000</name>
                  <description>Timer never reset</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b010</name>
                  <description>Timer reset on Timer Pin equal to Timer Output</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b011</name>
                  <description>Timer reset on Timer Trigger equal to Timer Output</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b100</name>
                  <description>Timer reset on Timer Pin rising edge</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b110</name>
                  <description>Timer reset on Trigger rising edge</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b111</name>
                  <description>Timer reset on Trigger rising or falling edge</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDEC</name>
              <description>Timer Decrement</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Decrement counter on FlexIO clock, Shift clock equals Timer output.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Decrement counter on Trigger input (both edges), Shift clock equals Timer output.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Decrement counter on Pin input (both edges), Shift clock equals Pin input.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Decrement counter on Trigger input (both edges), Shift clock equals Trigger input.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timer Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b00</name>
                  <description>Timer output is logic one when enabled and is not affected by timer reset</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b01</name>
                  <description>Timer output is logic zero when enabled and is not affected by timer reset</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b10</name>
                  <description>Timer output is logic one when enabled and on timer reset</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b11</name>
                  <description>Timer output is logic zero when enabled and on timer reset</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
